'''
1. Запитати у користувача його вік і визначити, ким він є: дитина(0-11),
підліток(12-18), дорослий (19-60) або пенсіонер (61- ......).
'''

age = int(input('Вкажіть свій вік: '))

if age < 0:
  print("Мені шкода, але тебе ще немає🥲")
elif 0 < age <= 11:
  print('дитина')
elif 11 < age <= 18:
  print('підліток')
elif 18 < age <= 60:
  print('дорослий')
elif 60 < age <= 120:
  print('пенсіонер')
elif 120 < age:
  print('Привіт з майбутнього)))')

'''
2. Запитати у користувача трьохзначне число і перевірити чи є в ньому однакові
цифри.
'''

num = int(input('Введіть трьохзначне число: '))

one = num // 100
two = num % 100 // 10
three = num % 10

if one == two:
  print('Є співпадіння. Число: ', one)
elif two == three:
    print('Є співпадіння. Число: ', two)
elif three == one:
    print('Є співпадіння. Число: ', one)
else:
    print('Всі числа унікальні')

'''
3. Запитати у користувача рік і перевірити чи він високосний. Високосний рік
кратний 400 або 4 і при цьому не кратний 100.
'''

year = int(input('Вкажіть рік: '))

if year % 400 == 0 or (year %100 != 0 and year %4 == 0) :
  print('Рік високосний')
else:
  print('Рік не високосний')

'''
4. Запитати у користувача пятизначне число і визначити чи є воно паліндромом.
Запитати у користувача довжину кола і периметр квадрату. Визначити чи може
це коло поміститися у вказаному квадраті.
'''

value = int(input('Введіть пʼятизначне число: '))

one = value // 10000
two = value % 10000 // 1000
three = value % 1000 // 100 
four = value % 100 // 10
five = value % 10

if one == five and two == four:
  print('Число є паліндромом!')
else: 
  print('Число не є паліндромом!')

'''
5.Запитати у користувача довжину кола і периметр квадрату. Визначити чи може
це коло поміститися у вказаному квадраті.
'''

import math

circle = float(input("Введіть довжину кола: "))
square = float(input("Введіть периметр квадрату: "))

investment = square / 4

if investment <= square:
    print("Коло може поміститися у квадраті.")
else:
    print("Коло не може поміститися у квадраті.")

'''
6. Задати користувачу 3 запитання, в кожному запитанні по 3 варіанта відповіді. За
кожну вірну відповідь нараховується по 2 бала. Після опитування вивести
користувачу кількість набраних балів
'''

rating = 0

question_1 = int(input('Дай відповідь на запитання: 3 + 5 × 2 = '))

if question_1 == 13:
  print('Відповідь правильна! нараховано 2 бали!')
  rating += 2
else:
  print('Відповідь не правильна!')

question_2 = int(input('Дай відповідь на запитання: 4 × 6 − 2 = '))

if question_2 == 22:
  print('Відповідь правильна! нараховано 2 бали!')
  rating += 2
else:
  print('Відповідь не правильна!')

question_3 = int(input('Дай відповідь на запитання: 10 / 2 + 7 = '))

if question_3 == 12:
  print('Відповідь правильна! нараховано 2 бали!')
  rating += 2
else:
  print('Відповідь не правильна!')
  
if rating == 0:
  print('BAD')
elif rating == 2:
  print('SO-SO')
elif rating == 4:
  print('GOOD')
elif rating == 6:
  print('EXCELLENT')

'''
7. Запитати у користувача час (години, хвилини, секунди) і перевірити коректність
введення даних.
'''

hour = int(input('Ведіть години: '))
minute = int(input('Ведіть хвилини: ')) 
second = int(input('Ведіть секунди: ')) 

if 0 <= hour <= 23 and 0 <= minute <= 59 and 0 <= second <= 59:
  print(f'Ведений час вірний. Ваш час {hour}:{minute}:{second}')
else:
  print('Формат часу невірний. Ведіть час повторно.')

'''
8. Запитати координати точки (х, у) та визначити номер чверті, до якої потрапила
ця точка. Необхідно врахувати випадки влучення точки на осі Х або Y або
початок координат.
'''

x = int(input("Введіть координату x: "))
y = int(input("Введіть координату y: "))

if x > 0 and y > 0:
    print("Точка знаходиться в першій чверті.")
elif x < 0 and y > 0:
    print("Точка знаходиться в другій чверті.")
elif x < 0 and y < 0:
    print("Точка знаходиться в третій чверті.")
elif x > 0 and y < 0:
    print("Точка знаходиться в четвертій чверті.")
elif x == 0 and y != 0:
    print("Точка лежить на вісі Y.")
elif x != 0 and y == 0:
    print("Точка лежить на вісі X.")
else:
    print("Точка знаходиться в початку координат.")

'''
9. Запросити у користувача номер місяця та вивести на екран його назву
'''

mount = int(input('Ведіть номер місяця: '))

if mount == 1:
    print('Січень')
elif mount == 2:
    print('Лютий')
elif mount == 3:
    print('Березень')
elif mount == 4:
    print('Квітень')
elif mount == 5:
    print('Травень')
elif mount == 6:
    print('Червень')
elif mount == 7:
    print('липень')
elif mount == 8:
    print('Серпень')
elif mount == 9:
    print('Вересень')
elif mount == 10:
    print('Жовтень')
elif mount == 11:
    print('Листопад')
elif mount == 12:
    print('Грудень')
else:
    print('Неправильно введений місяць')

'''
10. Запитати дату (день, місяць, рік) і вивести наступну дату. Зважте на можливість
переходу на наступний місяць, рік, а також високосний рік.
'''

day = int(input('Введіть день (1 - 31): '))
month = int(input('Введіть місяць (1-12): '))
year = int(input('Введіть рік (****): '))

if year % 400 == 0 or (year % 100 != 0 and year % 4 == 0):
    if month == 2:
        if 1 <= day <= 28:
            print(f'Наступне число {day + 1}.{month}.{year}')
        else:
            print(f'Наступне число 1.{month + 1}.{year}')
    elif month in [1,3,5,7,8,10,12]:
        if 1 <= day <= 30 and 1 <= month <= 11:
            print(f'Наступне число {day + 1}.{month}.{year}')
        elif day == 31 and 1 <= month <= 11:
            print(f'Наступне число 1.{month + 1}.{year}')
        elif day == 31 and month == 12:
            print(f'Наступне число 01.01.{year + 1}')
    elif month in [2,4,6,9,11]:
        if 1 <= day <= 29 and 1 <= month <= 11:
            print(f'Наступне число {day + 1}.{month}.{year}')
        elif day == 30 and 1 <= month <= 11:
            print(f'Наступне число 1.{month + 1}.{year}')
        elif day == 30 and month == 12:
            print(f'Наступне число 01.01.{year + 1}')
    else:
        print(f'Наступне число 01.01.{year + 1}')
else:
    if month == 2:
        if 1 <= day <= 27:
            print(f'Наступне число {day + 1}.{month}.{year}')
        else:
            print(f'Наступне число 1.{month + 1}.{year}')
    elif month in [1,3,5,7,8,10,12]:
        if 1 <= day <= 30 and 1 <= month <= 11:
            print(f'Наступне число {day + 1}.{month}.{year}')
        elif day == 31 and 1 <= month <= 11:
            print(f'Наступне число 1.{month + 1}.{year}')
        elif day == 31 and month == 12:
            print(f'Наступне число 01.01.{year + 1}')
    elif month in [2,4,6,9,11]:
        if 1 <= day <= 29 and 1 <= month <= 11:
            print(f'Наступне число {day + 1}.{month}.{year}')
        elif day == 30 and 1 <= month <= 11:
            print(f'Наступне число 1.{month + 1}.{year}')
        elif day == 30 and month == 12:
            print(f'Наступне число 01.01.{year + 1}')
    else:
        print(f'Наступне число 01.01.{year + 1}')