'''
Завдання 1
Користувач вводить із клавіатури два числа. Потрібно порахувати суму чисел у вказаному діапазоні, а також середньоарифметичне.
'''

# numOne = int(input('ВВедіть перше число: '))
# numTwo = int(input('ВВедіть друге число: '))

# sum = 0
# i = 0
# while numOne <= numTwo:
#     sum = sum + numOne
#     numOne += 1
#     i+=1
# else:
#     i = sum / i
# print(f'Сумма чисел {sum}, середньоарифметичне = {i}')

'''
Завдання 2
Користувач вводить із клавіатури число. Потрібно порахувати факторіал числа. Наприклад, якщо введено 3, факторіал числа 1*2*3 = 6

Формула для розрахунку факторіалу: n! = 1*2*3...*n, де n – число для розрахунку факторіалу.
'''

# num = int(input('Введіть число: '))

# i = 1
# res = 1
# while i <= num:
#     res = res * i
#     i += 1
# print('Факторіал = ', res)

'''
Завдання 3
Користувач вводить із клавіатури довжину лінії. Потрібно відобразити на екрані горизонтальну лінію з * , вказаної довжини.

Наприклад, якщо було введено 7, тоді виведення на екран буде таким:
'''

# num = int(input('Введіть число: '))

# i = 0
# while i < num:
#     i+=1
#     print('*',end='')
# else:
#     print('')

'''
Завдання 4
Користувач вводить із клавіатури довжину лінії та символ для заповнення лінії. Потрібно відобразити на екрані горизонтальну лінію із введеного символу, вказаної довжини.

Наприклад, якщо було введено 5 і &, тоді виведення на екран буде таким:
'''

# num = int(input('Введіть число: '))
# symbol = input('Введіть символ: ')

# i = 0
# while i < num:
#     i+=1
#     print(f'{symbol}',end='')
# else:
#     print('')


