'''
Завдання 1
Користувач вводить із клавіатури два числа (початок і кінець діапазону). Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом: якщо число кратне 7, його треба виводити на екран.
'''

# numOne = int(input('ВВедіть перше число: '))
# numTwo = int(input('ВВедіть друге число: '))

# while numOne <= numTwo:
#     if numOne % 7 == 0:
#         print(numOne)
#         numOne += 1
#     else:
#         numOne += 1

'''
Завдання 2
Користувач вводить із клавіатури два числа (початок і кінець діапазону). Необхідно проаналізувати всі числа в цьому діапазоні. Потрібно вивести на екран:

Всі числа діапазону.
Всі числа діапазону в спадному порядку.
Всі числа, кратні 7.
Кількість чисел, кратних 5.
'''

# numOne = int(input('ВВедіть перше число: '))
# numTwo = int(input('ВВедіть друге число: '))

# up = numOne
# down = numOne
# five = numOne
# seven = numOne
# last = numTwo

# while up <= numTwo:
#     print(up)
#     up += 1

# while last >= down:
#     print(last)
#     last -= 1

# while seven <= numTwo:
#     if seven % 7 == 0:
#         print(seven)
#         seven += 1
#         continue
#     seven += 1

# num = 0
# while five <= numTwo:
#     if five % 5 == 0:
#         five += 1
#         num += 1
#         continue
#     five += 1
# print(num)

'''
Завдання 3
Користувач вводить із клавіатури два числа (початок і кінець діапазону). Потрібно проаналізувати всі числа в цьому діапазоні. Виведення на екран має відбуватися за правилами, зазначеними нижче.

Якщо число кратне 3 (ділиться на 3 без залишку), потрібно вивести слово "Fizz". Якщо число кратне 5, потрібно вивести слово "Buzz". Якщо число кратне 3 і 5, потрібно вивести "Fizz Buzz". Якщо число не кратне ні 3, ні 5, потрібно вивести саме число.
'''

# numOne = int(input('ВВедіть перше число: '))
# numTwo = int(input('ВВедіть друге число: '))

# while numOne <= numTwo:
#     if numOne % 3 == 0 and numOne % 5 == 0:
#         numOne += 1
#         print('Fizz Buzz')
#     elif numOne % 3 == 0:
#         numOne += 1
#         print('Fizz')
#     elif numOne % 5 == 0:
#         numOne += 1
#         print('Buzz')
#     else:
#         numOne += 1
#         print(numOne)
