'''
1.Вивести на екран цілі числа від 1 до 100. - while
'''

# i = 0

# while i < 100:
#     i+=1
#     print(i, end=' ')

'''
2.Вивести на екран додатні парні числа, які не перевищують 200, та їх кількість. - while
'''

# i = 1

# while i < 200:
#     if i % 2 == 0:
#         print(i, end=' ')
#         i+=1
#     else:
#         i+=1

'''
3.Дано N (N>0). Вводяться N чисел. Знайти суму парних серед цих чисел. - while
'''

# count = int(input('Введіть кількість чисел: '))

# i=0
# res = 0

# while i < count:
#     n = int(input('Введіть число: '))
#     i+=1
#     if n % 2 == 0:
#         res = res + n
# else:
#     print('сумма парних чисел = ', res)

'''
4.Вводяться 10 чисел. Знайти суму та середнє арифметичне цих чисел. - while
'''

# i=0

# res = 0

# while i < 10:
#     i+=1
#     num = int(input(f'Ведіть {i} число: '))
#     res = res + num
# else:
#     print(f'Сумма цих чисел = {res}')
#     res = res / i
#     print(f'середнє арифметичне цих чисел = {res}')

'''
5.Скласти програму обчислення суми квадратів перших n-непарних чисел. Вивести на екран, крім суми квадратів і самі непарні числа і їх квадрати. - while
'''

# num = int(input('Введіть число для розрахунку: '))

# i = 0
# summa = 0
# while i < num:
#     if i % 2 != 0:
#         i+=1
#         res = i ** 2
#         summa = summa + res
#         print(f'Число {i} квадрат числа {res}')
#     else:
#         i+=1
# else:
#     print(f'Сумма всіх не парних чисел = {summa}')

'''
6.Вивести на екран цілі числа : 100 99 98 97...3 2 1. - while
'''

# i=100

# while i > 0:
#     print(i, end=' ',)
#     i -= 1
# else:
#     print('')

'''
7.Написати програму яка обчислює суму семи чисел, які вводяться з клавіатури. - while
'''

# i=0

# res = 0

# while i < 7:
#     i+=1
#     num = int(input(f'Ведіть {i} число: '))
#     res = res + num
# else:
#     print(f'Сумма цих чисел = {res}')

'''
8.Вивести на екран цілі числа від 14 до 123. - while
'''
# i=14

# while i <= 123:
#     print(i, end=' ')
#     i+=1

'''
9.Вивести на екран додатні непарні числа, які не перевищують 100. - while
'''

# i=0

# while  i < 100:
#     if i % 2 != 0:
#         print('Додатнє не парне число: ', i)
#         i+=1
#     else:
#         i+=1

'''
10.Дано N (N>0). Вводяться N чисел. Знайти кількість від’ємних серед них. - while
'''

# count = int(input('Введіть кількість чисел: '))

# i=0
# res = 0

# while i < count:
#     n = int(input('Введіть число: '))
#     i+=1
#     if n < 0:
#         res += 1
# else:
#     print('сумма парних чисел = ', res)

'''
11.Вводяться 8 чисел. Знайти добуток та середнє арифметичне цих чисел. - while
'''

# i = 0
# res = 0

# while i < 8:
#     i+=1
#     num = int(input(f'Введіть число {i}: '))
#     if res == 0:
#         res = num
#     res = res * num
# else:
#     print('Добуток цих чисел = ', res)
#     res /= num
#     print('середнє арифметичне цих чисел = ', res)

'''
12.Написати програму яка обчислює добуток п’яти чисел, які вводяться з клавіатури. - do..while
'''

# i = 0
# res = 0

# while i < 5:
#     i+=1
#     num = int(input(f'Введіть число {i}: '))
#     if res == 0:
#         res = num
#     res *= num
# else:
#     print('Добуток цих чисел = ', res)
