'''
1.Користувач вводить дві дати(день, місяць, рік у вигляді цілих чисел). Необхідно визначити і вивести кількість днів між цими двома датами. Для розрахунків врахувати високосні роки, а також коректне число днів у місяцях. (березень -31, вересень - 30, лютий 28 або 29)
'''



'''
2.Дано два числа. Якщо вони різні, то поміняти іх місцями.
'''

number_1 = int(input("Введіть перше число: "))
number_2 = int(input("Введіть друге число: "))

if number_1 != number_2:
    replacement = number_1
    number_1 = number_2
    number_2 = replacement

    print("Число 1 після обміну: ", number_1)
    print("Число 2 після обміну: ", number_2)
else:
    print("Числа рівні, обмін не потрібний.")


'''
3.Розробити програму, що переводить значення температури в градусах по Цельсію в температуру по Фаренгейту та навпаки. Співвідношення між температурами визначається формулою: TF = TC *1.8 +32. Діалог с користувачем реалізувати через систему меню.
'''

print("Оберіть опцію:")
print("1. Перевести температуру з градусів Цельсія в градуси Фаренгейта")
print("2. Перевести температуру з градусів Фаренгейта в градуси Цельсія")

option = input("Ваш вибір (введіть 1 або 2): ")

if option == '1':
    tc = int(input("Введіть температуру в градусах Цельсія: "))
    tf = tc * 1.8 + 32
    print(f"Температура в градусах Фаренгейта: {tf}")
elif option == '2':
    tf = int(input("Введіть температуру в градусах Фаренгейта: "))
    tc = (tf - 32) * 5/9
    print(f"Температура в градусах Цельсія: {tc}")
else:
    print("Некоректний вибір.")

'''
4.Дано три числа. Якщо перше число більше третього, то поміняти іх місцями.
'''

number_1 = int(input("Введіть перше число: "))
number_2 = int(input("Введіть друге число: "))
number_3 = int(input("Введіть третє число: "))

if number_1 > number_3:
    replacement = number_1
    number_1 = number_3
    number_3 = replacement

    print("Число 1 після обміну: ", number_1)
    print("Число 3 після обміну: ", number_3)
else:
    print("Число 1 менше числа 3. Обмін не потрібний.")
