'''
Завдання 1
Користувач вводить із клавіатури рядок. Зробіть поворот рядків і отриманий результат виведіть на екран.
'''

text = input('Введіть дані: ')

for i in range(len(text)-1, -1, -1):
    print(text[i], end='')
print()


'''
Завдання 2
Користувач вводить із клавіатури рядок. Порахуйте кількість букв, цифр у рядку. Виведіть обидва результати на екран.
'''

text = input('Введіть дані: ')

number = 0
string = 0

for i in range(len(text)):
    if text[i].isdigit():
        number += 1
    elif text[i].isalpha():
        string += 1

print("Кількість букв:", string)
print("Кількість цифр:", number)

'''
Завдання 3
Користувач вводить із клавіатури рядок і символ для пошуку. Порахуйте скільки разів у рядку зустрічається шуканий символ. Отримане число виведіть на екран.
'''

text = input('Введіть дані: ')
symbol = input('Введіть символ: ')

print(text.count(symbol))

'''
Завдання 4
Користувач вводить із клавіатури рядок і слово для пошуку. Порахуйте скільки разів у рядку зустрічається шукане слово. Отримане число виведіть на екран.
'''

text = input('Введіть дані: ')
symbol = input('Введіть слово: ')

print(text.count(symbol))

'''
Завдання 5
Користувач вводить із клавіатури рядок, слово для пошуку, слово для заміни. Зробіть у рядку заміну одного слова на інше. Отриманий рядок відобразіть на екрані.
'''

text = input('Введіть дані: ')
find = input('Яке слово знайти?: ')
replace = input('На яке замінити?: ')

print(text.replace(find, replace))