

# for i in range(1,11):
#     for j in range(1,10):
#         print(f'{j} * {i} = {j*i}', end='\t')
#     print()

'''
1. Написати програму, яка для чисел у діапазоні від A до B визначала кількість їхніх дільників. Наприклад, A = 10, B = 15. Дільники для числа 10 — 1 2 5 10; Дільники для числа 11 — 1 11; Дільники для числа 12 — 1 2 3 4 6 12; Дільники для числа 13 — 1 13; Дільники для числа 14 — 1 2 7 14; Дільники для числа 15 — 1 3 5 15.
'''

for i in range(10,16):
    print(i, ' - ', end=' ')
    for j in range(1,i+1):
        if i % j == 0:
            print(j, end=' ')
    print()
    
'''
2. Створити програму, яка виводить на екран прості числа в діапазоні від 2 до 1000. (Число називається простим, якщо воно ділиться тільки на 1 і на саме себе без залишку; причому числа 1 і 2 за прості не вважаються).
'''

for i in range(2, 1001):
    for j in range(2, i // 2 + 1):
        if i % j == 0:
            break
    else:
        print(i)
        
'''
3. На валізі стоїть тризначний код. Він складається з цифр, які не повторюються. Напишіть програму, яка виведе всі можливі такі комбінації цифр. А також визначте, скільки часу знадобиться для відкриття валізи, в гіршому
'''

for i in range(100, 1000):
    one = i // 100
    two = i % 100 // 10
    thre = i % 10

    if (one != two) and (two != thre) and (thre != one):
        print(i)