'''
Модуль 3. Оператори розгалужень
Частина 1
'''

'''
Завдання 1
Користувач вводить із клавіатури число. Необхідно перевірити його на парність і непарність. Якщо число парне, потрібно вивести на екран число і напис Even number. Якщо число непарне виведіть на екран число і напис Odd number.
'''

# i = int(input('Enter the number: '))

# if i % 2 == 0:
#     print(f'{i} Even number')
# else:
#     print(f'{i} Odd number')

'''
Завдання 2
Користувач вводить із клавіатури число. Необхідно перевірити його на кратність 7. Якщо число кратне, потрібно вивести на екран число і напис Number is a multiple of 7. Якщо число не кратне, виведіть на екран число і напис Number is not a multiple of 7.
'''

# i = int(input('Enter the number: '))

# if i % 7 == 0:
#     print(f'{i}, Number is a multiple of 7')
# else:
#     print(f'{i}, Number is not a multiple of 7')

'''
Завдання 3
Користувач вводить із клавіатури два числа. Необхідно знайти максимум із двох чисел і вивести його на екран.
'''

'''
Завдання 4
Користувач вводить із клавіатури два числа. Необхідно знайти мінімум із двох чисел і вивести його на екран.
'''

'''
Завдання 5
Користувач вводить із клавіатури два числа. Залежно від вибору користувача потрібно показати суму двох чисел, різницю двох чисел, середньоарифметичне або добуток двох чисел.
'''