#Модуль 2. Змінні та типи даних

# Завдання 1
# Користувач вводить із клавіатури два числа. Необхідно знайти суму чисел, різницю чисел, добуток чисел. Результат обчислень вивести на екран.

# num1 = int(input('Число 1:'))
# num2 = int(input('Число 2:'))

# suma = num1 + num2
# sub = num1 - num2
# mul = num1 * num2
# div = num1 / num2
# remainder = num1 % num2
# degree = num1 ** num2

# print(f'Сума: {suma}')
# print(f'Різниця: {sub}')
# print(f'Добуток: {mul}')
# print(f'Частка: {div}')
# print(f'Остача: {remainder}')
# print(f'Степінь: {degree}')

# Завдання 2
# Користувач вводить із клавіатури два числа. Перше число — це значення, друге число — відсоток, який необхідно вирахувати. Наприклад, ми ввели з клавіатури 50 і 10. Потрібно вивести на екран 10 відсотків від 50. Результат: 5.

# num1 = int(input('Число: '))
# num2 = int(input('Відсоток: '))

# percentage = (num1 / 100) * num2

# print(percentage)

# Завдання 3
# Напишіть програму, що обчислює площу прямокутника. Користувач із клавіатури вводить ширину і висоту прямокутника.

# num1 = int(input('Довжина:'))
# num2 = int(input('Ширина:'))

# suma = num1 * num2

# print(f'Довжина прямокутника {num1}, ширина прямокутника {num2}, площа = {suma}')