print('''
      Завдання 9
Користувач вводить з клавіатури розмір одного файлу в гігабайтах і швидкість
інтернет-з’єднання в бітах на секунду. Порахувати, за скільки годин, хвилин і секунд
завантажується файл.
      ''')

# Змінив швидкість на кБіт/секунду, тому що захмарні години виходять😅

data = int(input('Введіть обʼєм в Гб: '))
speed = int(input('Введіть швидкість завантаєення в кБіт/сек: '))

speed *= 1000
b = data * 1024 * 1024 * 1024
total = b * 8 // speed

hourse = total // 3600
minute = total % 3600 // 60
secund = total % 60

print(f'Час завантаження {(hourse)}:{minute}:{secund}.')