print('''
      Завдання 2
Написати програму обчислення відстані між населеними пунктами. Нижче наведено
рекомендований вигляд:
Обчислення відстані між населеними пунктами.
Введіть вихідні дані:
Масштаб карти (кількість кілометрів в одному сантиметрі) -> 120
Відстань між точками, які зображують населені пункти (см) -> 3.5
Відстань між населеними пунктами 420 км.
      ''')

scale = int(input('Масштаб: '))
distance = float(input('Дистанція: '))

res = scale * distance

print('Відстань між населеними пунктами', int(res), 'км.')
