print('''
      Створити додаток, який виводить на екран таку таблицю:
Користувач вводить з клавіатури час у секундах, що минув з початку дня. Вивести на
екран поточний час у годинах, хвилинах і секундах. Порахувати, скільки годин, хвилин і
секунд залишилося до півночі.
      ''')

sec = int(input('Час в секундах:'))

time = 86400 - sec
hourse = time // 3600
minute = time % 3600 // 60
secund = time % 60

print(' +', '-'*20, '+', '\n', '| До опівночі лишилось |', '\n', '+', '-'*20, '+', '\n', f'|\t{hourse}:{minute}:{secund} годин\t|', '\n', '+', '-'*20, '+')